app/Controllers/TaskManager.php

SELECT *
FROM `projects`
ORDER BY `name` ASC
SELECT *
FROM `task_categories`
ORDER BY `project_id` ASC, `sort_order` ASC, `name` ASC
SELECT *
FROM `tasks`
ORDER BY `completed` ASC, `id` DESC
---
    public function data(): ResponseInterface
    {
        $projects = $this->projects
            ->orderBy('name', 'ASC')
            ->findAll();

        $categories = $this->categories
            ->orderBy('project_id', 'ASC')
            ->orderBy('sort_order', 'ASC')
            ->orderBy('name', 'ASC')
            ->findAll();

        $tasks = $this->tasks
            ->orderBy('completed', 'ASC')
            ->orderBy('id', 'DESC')
            ->findAll();

INSERT INTO `projects` (`name`, `color`) VALUES ('A', NULL)
SELECT *
FROM `projects`
WHERE `projects`.`id` = 5
---
    public function createProject(): ResponseInterface
    {
        $data = $this->input();
        $name = trim((string) ($data['name'] ?? ''));

        if ($name === '') {
            return $this->json([
                'success' => false,
                'message' => 'Project name is required.',
            ], 422);
        }

        $id = $this->projects->insert([
            'name'  => $name,
            'color' => ($data['color'] ?? '') ?: null,
        ], true);

        if (!$id) {
            return $this->json([
                'success' => false,
                'message' => 'Unable to create project.',
            ], 500);
        }

        return $this->json([
            'success' => true,
            'project' => $this->projects->find($id),

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = 125
---
    public function updateTask(int $id): ResponseInterface
    {
        $task = $this->tasks->find($id);

UPDATE `tasks` SET `completed` = 1
WHERE `tasks`.`id` IN (125)
---
        }

        if ($update) {
            $this->tasks->update($id, $update);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = 125
---

        return $this->json([
            'success' => true,
            'task'    => $this->tasks->find($id),

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = 122
DELETE FROM `tasks`
WHERE `id` IN (122)
---
    public function deleteTask(int $id): ResponseInterface
    {
        if (!$this->tasks->find($id)) {
            return $this->json([
                'success' => false,
                'message' => 'Task not found.',
            ], 404);
        }

        $this->tasks->delete($id);

SELECT *
FROM `projects`
WHERE `projects`.`id` = 5
---
    public function importTasks(): ResponseInterface
    {
        $data      = $this->input();
        $projectId = (int) ($data['project_id'] ?? 0);
        $incoming  = $data['tasks'] ?? [];

        if (!$this->projects->find($projectId)) {

SELECT *
FROM `task_categories`
WHERE `project_id` = 5
---
         */
        $categoryMap = [];

        foreach ($this->categories
            ->where('project_id', $projectId)
            ->findAll() as $category) {

SELECT MAX(`sort_order`) AS `sort_order`
FROM `task_categories`
WHERE `project_id` = 5
 LIMIT 1
---
        /*
         * Determine next sort order for newly imported categories.
         */
        $maxSortRow = $this->categories
            ->where('project_id', $projectId)
            ->selectMax('sort_order')
            ->first();

SELECT *
FROM `tasks`
WHERE `project_id` = 5
---
         */
        $taskMap = [];

        foreach ($this->tasks
            ->where('project_id', $projectId)
            ->findAll() as $existingTask) {

INSERT INTO `task_categories` (`project_id`, `name`, `sort_order`) VALUES (5, 'Tweakings', 10)
---
                    /*
                     * Create category only once.
                     */
                    $categoryId = (int) $this->categories->insert([
                        'project_id' => $projectId,
                        'name'       => $rawCategory,
                        'sort_order' => $nextSortOrder,
                    ], true);

INSERT INTO `tasks` (`project_id`, `category_id`, `body`, `assignee`, `due_date`, `completed`) VALUES (6, 13, 'Mobile Responsive', NULL, NULL, 0)
---
                continue;
            }

            $taskId = $this->tasks->insert([
                'project_id'  => $projectId,
                'category_id' => $categoryId,
                'body'        => $body,
                'assignee'    => null,
                'due_date'    => null,
                'completed'   => !empty($item['completed']) ? 1 : 0,
            ], true);